Repository: JustinBenito/innoagri
Catalog: lib/l10n/app_*.arb
Languages: ta

# appTitle
source: Uzhavan - Smart Agriculture
ta: உழவன் - ஸ்மார்ட் வேளாண்மை

# chatbotTitle
source: AI Chatbot
ta: ஏஐ உரையாடல்

# forumTitle
source: Forum
ta: வலைவழி குழு

# soilTitle
source: Soil
ta: மண்

# chatbotPlaceholder
source: Chatbot conversation will appear here.
ta: உரையாடல் இங்கே தோன்றும்.

# forumPlaceholder
source: Forum feature coming soon.
ta: வலைவழி குழு விரைவில் வருகிறது.

# soilPlaceholder
source: Soil sensor integration coming soon.
ta: மண் சென்சார் ஒருங்கிணைப்பு விரைவில் வருகிறது.

# typeMessage
source: Type your message here...
ta: உங்கள் செய்தியை இங்கே தட்டச்சு செய்யுங்கள்...

source: FarConnect
ta: பண்ணை இணைப்பு

source: Weather Conditions
ta: வானிலை நிலைமைகள்

source: Temperature
ta: வெப்பநிலை

source: Wind Speed
ta: காற்றின் வேகம்

source: Humidity
ta: ஈரப்பதம்

source: UV Index
ta: UV குறியீடு

source: Soil Moisture
ta: மண் ஈரப்பதம்

source: Daily Nudge
ta: தினசரி அறிவுரை

source: Wanna Talk ?
ta: பேச விரும்புகிறீர்களா?

# wannaTalkDesc
source: Talk to our Uzhavan Chatbot for assistance on your crops and also in farming in general.
ta: உங்கள் பயிர்கள் மற்றும் பொதுவான விவசாயத்தில் உதவிக்கு எங்கள் உழவன் சாட்போட்டுடன் பேசுங்கள்.

source: Start Chatting
ta: உரையாடலைத் தொடங்குங்கள்

source: Identify Plant Disease
ta: தாவர நோயைக் கண்டறியுங்கள்

# identifyPlantDiseaseDesc
source: Upload or take a photo of your plant to detect diseases and get treatment recommendations.
ta: நோய்களைக் கண்டறிய மற்றும் சிகிச்சை பரிந்துரைகளைப் பெற உங்கள் தாவரத்தின் புகைப்படத்தை பதிவேற்றவும் அல்லது எடுக்கவும்.

source: Scan Plant
ta: தாவரத்தை ஸ்கேன் செய்யுங்கள்

# generatingAdvice
source: Generating personalized advice...
ta: தனிப்பயனாக்கப்பட்ட அறிவுரையை உருவாக்குகிறது...

source: Typing response...
ta: பதிலை எழுதுகிறேன்...

# defaultNudge
source: Monitor your crops regularly and adjust watering based on weather conditions.
ta: உங்கள் பயிர்களை தொடர்ந்து கண்காணித்து, வானிலை நிலைமைகளின் அடிப்படையில் நீர்ப்பாசனத்தை சரிசெய்யவும்.
